In [1]:
import pandas as pd
import numpy as np

In [2]:
keys = {
    "sub_id": range(1, 101),
    "stu_id": range(1, 101)
}
df_keys = pd.DataFrame(keys)
print(df_keys.shape)
df_keys.head()

(100, 2)

   sub_id  stu_id
0       1       1
1       2       2
2       3       3
3       4       4
4       5       5

In [3]:
nombres = """Nasir Buckley
Lilia Wu
Aoife Mayo
Shanelle Holman
Elleanor Brady
Nadir Leal
Elly Haney
Nelly Devlin
Kairon Phan
Ptolemy Jeffery
Taha Gill
Riley-Jay Valencia
Carlos Clark
Miller Cooper
Usama Montes
Raife Gregory
Cavan Bowler
Khushi Langley
Katy Bateman
Valentino Smith
Faiz Sims
Davina Navarro
Kristian Brennan
Murray Matthews
Emilie Bates
Carla Branch
Clay Bloom
Tayyib Drew
Azra Randall
Arianne Booth
Shakir Swanson
Mert Mcguire
Don Bond
Hana Redfern
Abid Parsons
Beatriz Ayala
Hisham Sheldon
Kacie Reese
Sheikh Ellis
May Daniel
Yasser Rosales
Nicky Corrigan
Deacon Sharpe
Ryley Chadwick
Laibah Ridley
Tre Frye
Margo Dalby
Yasmin Farrington
Evalyn Freeman
Fearne Preece
Dhruv Bruce
Jia Schroeder
Phyllis Heath
Katarina Velez
Andy Bone
Sabrina Blaese
Evangeline Warner
Nile Hutchings
Javan Pike
Danyaal Bostock
Aine Miller
Pamela Copeland
Aurelia Edwards
Bea Arroyo
Brianna Corbett
Aasiyah Villarreal
Bert Sanders
Nellie Cotton
Riley Hudson
Kristina Odom
Rebecca Quintero
Buddy Fleming
Husnain Abbott
Hafsa Galindo
Kirk Pineda
Zaynah White
Katie-Louise Larson
Sonnie Delarosa
Jo Mackay
Shereen Sharp
Bibi Hines
Josef Bullock
Katya Suarez
Shannen Rooney
Thierry Boone
Aryan Oakley
Caitlin Mcculloch
Yara Bryant
Caoimhe Milner
Ziggy O'Reilly
Hajrah Dale
Olivia-Mae Glenn
Cristina Robinson
Lila Sutherland
Arnas Bravo
Malachy Schofield
Cherry Salgado
Kylo Mcclure
Tamzin Yu
Tazmin Lucas"""

In [4]:
names = []
surnames = []
for both in nombres.split("\n"):
    for i, n in enumerate(both.split(" ")):
        if i == 0:
            names.append(n)
        else:
            surnames.append(n)

In [5]:
course = [1]*25+[2]*25+[3]*25+[4]*25

In [6]:
students = {
    "stu_id":range(1, 101),
    "name": names,
    "surname": surnames,
    "course_n": course
}

students_df = pd.DataFrame(students)
print(students_df.shape)
students_df.head()

(100, 4)

   stu_id      name  surname  course_n
0       1     Nasir  Buckley         1
1       2     Lilia       Wu         1
2       3     Aoife     Mayo         1
3       4  Shanelle   Holman         1
4       5  Elleanor    Brady         1

In [7]:
asig = ["economics"]*20+["math"]*20+["statistics"]*20+["econometrics"]*20+["theory games"]*20

In [8]:
subjects = {
    "sub_id":range(1, 101),
    "subject": asig,
    "course_n": course
}

subjects_df = pd.DataFrame(subjects)
print(subjects_df.shape)
subjects_df.head()

(100, 3)

   sub_id    subject  course_n
0       1  economics         1
1       2  economics         1
2       3  economics         1
3       4  economics         1
4       5  economics         1

In [9]:
import os
import dotenv
dotenv.load_dotenv()

mysqlpass = os.getenv("mysqlpass")

In [10]:
import pymysql

# create connection
connection = pymysql.connect(host='localhost',
                             user='root',
                             password=mysqlpass)

# Create cursor
my_cursor = connection.cursor()

# Execute Query
my_cursor.execute("create DATABASE test")

1

In [11]:
from sqlalchemy import create_engine

# create sqlalchemy engine for mysql db
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="root",
                               pw=mysqlpass,
                               db="test"))
engine

Engine(mysql+pymysql://root:***@localhost/test)

In [12]:
df_keys.to_sql('keys', con = engine, if_exists = 'replace', chunksize = 1000)
students_df.to_sql('students', con = engine, if_exists = 'replace', chunksize = 1000)
subjects_df.to_sql('subjects', con = engine, if_exists = 'replace', chunksize = 1000)

#closing connection
connection.close()

In [13]:
#open connection again with the new db
connection = pymysql.connect(host='localhost',
                             user='root',
                             password=mysqlpass,
                             db="test")

my_cursor = connection.cursor()

In [14]:
my_cursor.execute("""select *
from test.subjects""")

# Fetch the records
result = my_cursor.fetchall()

pd.DataFrame(result, columns=["index", "id", "subject", "course"]).drop(columns={"index"})

     id       subject  course
0     1     economics       1
1     2     economics       1
2     3     economics       1
3     4     economics       1
4     5     economics       1
..  ...           ...     ...
95   96  theory games       4
96   97  theory games       4
97   98  theory games       4
98   99  theory games       4
99  100  theory games       4

[100 rows x 3 columns]

In [15]:
connection.close()